app/Controllers/Profile.php

SELECT *
FROM `user`
WHERE `user`.`id` = '3'
---
    public function index(): string
    {
        $user = $this->user->find(session()->get('id'));