app/Models/User.php

SELECT *
FROM `user`
WHERE `email` = 'dijenaufal@gmail.com'
 LIMIT 1
---
    function getuser($email = false)
    {
        return $this->where(['email' => $email])->first();